Revit 2027 API
BuiltInFailures.FloorFailures Class
 Failures related to floors and slabs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FloorFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FloorFailures
Public NotInheritable Class FloorFailures
public ref class FloorFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FloorFailures = class end
The BuiltInFailures.FloorFailures type exposes the following members.
Properties
Name | Description
FloorSlopeExceedsThreshold |  Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties.
Top
See Also
Reference
Autodesk.Revit.DB Namespace